# YOLOv8-MNC ‒ “small” variant, rebuilt for Ultralytics v8.3+
# Matches the architecture described in the YOLOv8-MNC paper:
#   • Extra P2/4 head for tiny objects
#   • BiFPN neck with CARAFE up-sampling
#   • NWD + WIoU-v3 losses
#   • Anchor-free Detect head (4 scales: P2–P5)
# -----------------------------------------------------------

# Cell 3 – Create yolov8_mnc.yaml next to the notebook
yaml_text = """
nc: 1
names:
  0: cigarette
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  - [-1, 1, Conv,  [ 64, 3, 2 ]]
  - [-1, 1, Conv,  [128, 3, 2 ]]
  - [-1, 3, C2f,   [128]]
  - [-1, 1, Conv,  [256, 3, 2 ]]
  - [-1, 6, C2f,   [256]]
  - [-1, 1, Conv,  [512, 3, 2 ]]
  - [-1, 6, C2f,   [512]]
  - [-1, 1, Conv,  [768, 3, 2 ]]
  - [-1, 3, C2f,   [768]]
  - [-1, 1, SPPF,  [1024, 5]]

neck:
  - [[6, 8, 9], 1, BiFPN,  [768]]
  - [-1, 1, CARAFE,[384]]

head:
  - [[1, 3, 5, 7], 1, Detect,
     [[80,80],[40,40],[20,20],[10,10]],
     True]

loss:
  box: nwd
  dfl: wiou
task: detect
"""
open("yolov8_mnc.yaml", "w").write(yaml_text)
print("✓ yolov8_mnc.yaml written")


# Cell 6
from ultralytics import YOLO

model = YOLO("yolov8_mnc.yaml")               # build from our config
results = model.train(
    data="dataset/data.yaml",                 # your dataset YAML
    imgsz=960,
    epochs=200,
    batch=16,
    optimizer="AdamW",
    lr0=5e-4,
    lrf=0.05,
    hsv_h=0.015, hsv_s=0.7, hsv_v=0.4,
    mosaic=1.0, mosaic9=True, copy_paste=0.2,
    workers=8,
    device=0                                   # set to 'cpu' if no GPU
)
